# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'bc'
brew 'coreutils' # Those that come with macOS are outdated
brew 'emacs'
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'htop'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'mackup'
#brew 'mas' # Mac App Store manager
brew 'nmap'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'r'
brew 'rclone'
brew 'svn' # Needed to install fonts
brew 'sha2'
brew 'tmux'
brew 'watch'
brew 'wget'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
#brew 'composer'
brew 'imagemagick'
#brew 'meilisearch'
#brew 'nginx'
#brew 'node'
#brew 'redis'
#brew 'yarn'


# Apps
cask 'alt-tab'
cask 'citrix-workspace'
#cask 'dbngin'
cask 'github'
cask 'google-chrome-beta'
cask 'google-drive'
#cask 'helo'
cask 'imageoptim'
cask 'insomnia'
cask 'iterm2'
# do we want mamba from here?
cask 'mambaforge'
cask 'microsoft-office'
cask 'microsoft-remote-desktop'
cask 'microsoft-teams'
#cask 'pastebot'
#cask 'phpmon'
#cask 'ray'
#cask 'raycast'
#cask 'readdle-spark'
#cask 'screenflow'
#cask 'slack'
#cask 'tableplus'
cask 'rectangle'
cask 'rstudio'
cask 'stats'
cask 'the-unarchiver'
#cask 'tinkerwell'
#cask 'transmit'
cask 'tailscale'
#cask 'tuple'
cask 'visual-studio-code-insiders'
cask 'wireshark'
cask 'vlc'
cask 'vpn-by-google-one'
cask 'zoom'
cask 'zotero'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato' 
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-3'
cask 'font-source-serif-4'

# Mac App Store
#mas 'Byword', id: 420212497
#mas 'Giphy Capture', id: 668208984
#mas 'Keynote', id: 409183694
#mas 'Numbers', id: 409203825
#mas 'Speedtest', id: 1153157709
#mas 'Spring', id: 1508706541
#mas 'Things', id: 904280696
